In [4]:
# what is pandas?
# pandas is a python library usees to working with tabular data 
# it has function for analysis cleaning, exploring and manipulating the data 
# it is makes data analysiseasy and fast

In [3]:
import pandas as pd

In [ ]:
pands provide 2 main data structure
1 Series 
2 DataFrame

Series
is like a  single colume or 1d array  
series(data,index,dtype)

In [5]:
list1=[1,2,3,4,5,6]
s=pd.Series(list1)
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [8]:
#we can change the index and data type 
marks =[12,13,20,11,17]
s=pd.Series(marks,index=["marathi","hindi","english","maths","Geography"],dtype=float)
print(s)

marathi      12.0
hindi        13.0
english      20.0
maths        11.0
Geography    17.0
dtype: float64

In [9]:
# indexing and scaling
print(s[2])

20.0

C:\Users\kolib\AppData\Local\Temp\ipykernel_20328\408939512.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[2])

In [10]:
print(s[1:5])

hindi        13.0
english      20.0
maths        11.0
Geography    17.0
dtype: float64

In [11]:
# we create a series by using the dictionary
d={"A":[1,2,3,4,5],"B":[3,4,6,7,8]}
s=pd.Series(d)
print(s)

A    [1, 2, 3, 4, 5]
B    [3, 4, 6, 7, 8]
dtype: object

In [13]:
d={"d1":12,"d2":56,"d3":56,"d4":78}
s=pd.Series(d)
print(s)
print(type(s))

d1    12
d2    56
d3    56
d4    78
dtype: int64
<class 'pandas.core.series.Series'>

In [15]:
d={"d1":12,"d2":56,"d3":56,"d4":78}
s=pd.Series(d,index=["d1","d2"])
print(s)

d1    12
d2    56
dtype: int64

In [19]:
x=pd.Series(12,index=[0,1,2,3,4])
print(x)

0    12
1    12
2    12
3    12
4    12
dtype: int64

In [16]:
y=pd.Series ([14,16,12,11,15])
print(y)

0    14
1    16
2    12
3    11
4    15
dtype: int64

In [20]:
# addition
res=x+y
print(res)

0    26
1    28
2    24
3    23
4    27
dtype: int64

In [21]:
# subtraction 
res=x-y
print(res)

0   -2
1   -4
2    0
3    1
4   -3
dtype: int64

In [22]:
# multiple
res=x*y
print(res )

0    168
1    192
2    144
3    132
4    180
dtype: int64

In [23]:
# division
res=x/y
print(res)

0    0.857143
1    0.750000
2    1.000000
3    1.090909
4    0.800000
dtype: float64

In [24]:
# concat
res=pd.concat([x,y])
print(res)

0    12
1    12
2    12
3    12
4    12
0    14
1    16
2    12
3    11
4    15
dtype: int64

In [26]:
x=pd.Series([12,34,56])
y=pd.Series(12,index=[5])
res=pd.concat([x,y])
print(res)

0    12
1    34
2    56
5    12
dtype: int64

In [27]:
# update
s=pd.Series([34,45,56])
s[0]=100
print(s)

0    100
1     45
2     56
dtype: int64

In [28]:
# delete 
s=pd.Series([34,45,56,12,23,52])
s=s.drop(1) # removing by position
print(s)

0    34
2    56
3    12
4    23
5    52
dtype: int64

Dataframe

In [ ]:
# whta is data freame
# pandas datafreame is a two dimensions array
# or we can say complete table of colume and rows

In [29]:
d={"Naman":[1,2,3,4,5],"Lina":[3,4,6,7,8],"Komal":[3,4,6,7,8]}
df=pd.DataFrame(d)
print(df)

   Naman  Lina  Komal
0      1     3      3
1      2     4      4
2      3     6      6
3      4     7      7
4      5     8      8

In [32]:
d={"Naman":[19,29,35,47,50],"Lina":[30,45,68,74,86],"Komal":[35,45,68,79,86]}
df=pd.DataFrame(d,index=["marathi","hindi","english","maths","Geography"])
print(df)

           Naman  Lina  Komal
marathi       19    30     35
hindi         29    45     45
english       35    68     68
maths         47    74     79
Geography     50    86     86

In [33]:
df=pd.DataFrame(d,columns=["Naman"],index=["marathi","hindi","english","maths","Geography"])
print(df)

           Naman
marathi       19
hindi         29
english       35
maths         47
Geography     50

In [34]:
# we cretae a dataset by using the nested list 
list1=[[12,23,56,67],[67,52,62,55]]
df=pd.DataFrame(list1)
print(df)

    0   1   2   3
0  12  23  56  67
1  67  52  62  55

In [51]:
# # i will create a Datframe by using a Series

In [52]:
d={"A":pd.Series([12,34,26,31,42]),"B":pd.Series ([56,23,22,55,12])}
dd=pd.DataFrame(d)
print(dd)

    A   B
0  12  56
1  34  23
2  26  22
3  31  55
4  42  12

In [53]:
dd["C"]=dd["A"]+dd["B"]
print(dd)

    A   B   C
0  12  56  68
1  34  23  57
2  26  22  48
3  31  55  86
4  42  12  54

In [62]:
dd["E"]=dd["C"]>20
print(dd)

    A   B   C     D     E
0  12  56  68  True  True
1  34  23  57  True  True
2  26  22  48  True  True
3  31  55  86  True  True
4  42  12  54  True  True

In [63]:
# insert(position,col_name,value)
dd.insert(2,"B1",[16,23,20,25,52])

print(dd)

    A   B  B1   C     D     E
0  12  56  16  68  True  True
1  34  23  23  57  True  True
2  26  22  20  48  True  True
3  31  55  25  86  True  True
4  42  12  52  54  True  True

In [64]:
dd

    A   B  B1   C     D     E
0  12  56  16  68  True  True
1  34  23  23  57  True  True
2  26  22  20  48  True  True
3  31  55  25  86  True  True
4  42  12  52  54  True  True

In [65]:
#delete 
del dd["B1"]

In [66]:
dd

    A   B   C     D     E
0  12  56  68  True  True
1  34  23  57  True  True
2  26  22  48  True  True
3  31  55  86  True  True
4  42  12  54  True  True

In [67]:
dd["D"]=dd["A"]-dd["B"]
print(dd)

    A   B   C   D     E
0  12  56  68 -44  True
1  34  23  57  11  True
2  26  22  48   4  True
3  31  55  86 -24  True
4  42  12  54  30  True

In [68]:
dd

    A   B   C   D     E
0  12  56  68 -44  True
1  34  23  57  11  True
2  26  22  48   4  True
3  31  55  86 -24  True
4  42  12  54  30  True

In [69]:
# pop 
# its return the remove column 
res=dd.pop("E")
print(res)

0    True
1    True
2    True
3    True
4    True
Name: E, dtype: bool

In [70]:
dd

    A   B   C   D
0  12  56  68 -44
1  34  23  57  11
2  26  22  48   4
3  31  55  86 -24
4  42  12  54  30

In [71]:
print(res) # output form the pop

0    True
1    True
2    True
3    True
4    True
Name: E, dtype: bool

In [72]:
dd.shape

(5, 4)

In [73]:
dd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
 3   D       5 non-null      int64
dtypes: int64(4)
memory usage: 292.0 bytes

<!-- .loc (Label-based indexing):
.loc is used to access rows and columns by their labels (names).

.iloc (Integer-location based indexing):
.iloc is used to access rows and columns by their integer positions (0-based index). -->

In [ ]:
# iloc and loc

In [5]:
d={"Student_id":[101,102,103,104,105],
  "Student_name":["Jay","Ajay","jem","Rohan","virat"],
  "Course":["Maths","English","SST","Geography","Hindi"],
  "Marks":[67,89,79,60,70],
  "Grade":["C","A","B","C","B"]}
df=pd.DataFrame(d)
df

   Student_id Student_name     Course  Marks Grade
0         101          Jay      Maths     67     C
1         102         Ajay    English     89     A
2         103          jem        SST     79     B
3         104        Rohan  Geography     60     C
4         105        virat      Hindi     70     B

In [6]:
df=pd.DataFrame(d,index=["a","b","c","d","e"])
df

   Student_id Student_name     Course  Marks Grade
a         101          Jay      Maths     67     C
b         102         Ajay    English     89     A
c         103          jem        SST     79     B
d         104        Rohan  Geography     60     C
e         105        virat      Hindi     70     B

In [7]:
df.columns

Index(['Student_id', 'Student_name', 'Course', 'Marks', 'Grade'], dtype='object')

In [9]:
# will fetch specific roe and colum
df.loc[["a","b","c"],["Student_id","Student_name","Course"]]

   Student_id Student_name   Course
a         101          Jay    Maths
b         102         Ajay  English
c         103          jem      SST

In [11]:
# fetch all rows and spefice columen
df.loc[:,["Student_name","Course"]]

  Student_name     Course
a          Jay      Maths
b         Ajay    English
c          jem        SST
d        Rohan  Geography
e        virat      Hindi

In [12]:
df.loc["a"]

Student_id        101
Student_name      Jay
Course          Maths
Marks              67
Grade               C
Name: a, dtype: object

In [13]:
df.iloc[0]

Student_id        101
Student_name      Jay
Course          Maths
Marks              67
Grade               C
Name: a, dtype: object